Repository: YarosMallorca/NetVerify
Catalog: lib/locales/app_*.arb
Languages: ca

source: Add network
ca: Afegir xarxa

# allFieldsRequired
source: All fields must be filled
ca: Tots els camps han de ser completats

# allFunctional
source: All networks are functioning correctly with no overlaps.
ca: Totes les xarxes funcionen correctament sense solapaments.

# appDescription
source: A simple network verification tool
ca: Eina simple de verificació de xarxes

source: Cancel
ca: Cancel·lar

source: Change color
ca: Canviar color

source: Dark theme
ca: Tema fosc

source: Delete network
ca: Eliminar xarxa

source: Done
ca: Fet

# invalidEndIP
source: Invalid IP end address
ca: Adreça IP final no vàlida

# invalidStartIP
source: Invalid IP start address
ca: Adreça IP inicial no vàlida

source: Invalid Subnet Mask
ca: Màscara de subxarxa no vàlida

# ipEndHint
source: IP end
ca: IP final

# ipStartHint
source: IP start
ca: IP inicial

source: Light theme
ca: Tema clar

source: Network name
ca: Nom de la xarxa

source: Network Summary
ca: Resum de les xarxes

# notInRange
source: IP range does not fit within the subnet
ca: El rang d'IP no encaixa dins de la subxarxa

# overlapDetails
source: {firstNetworkName} overlaps with {secondNetworkName}
ca: {firstNetworkName} es solapa amb {secondNetworkName}

# overlapsDetected
source: Overlaps detected in the following networks:
ca: S'han detectat solapaments a les següents xarxes:

# overlapsWith
source: Overlaps with {networkName}
ca: Es solapa amb {networkName}

source: Pick a color
ca: Tria un color

source: Select Language
ca: Seleccionar idioma

source: Select Theme
ca: Seleccionar tema

# someNetworkErrors
source: Some networks have errors.
ca: Algunes xarxes tenen errors.

# subnetMaskHint
source: Subnet Mask (CIDR notation)
ca: Màscara de subxarxa (notació CIDR)

source: System Default
ca: Predeterminat
